results/results_old/data/run3/jvm-static/erik-laptop/quarkus-io-thread-100000-MEASURE.wrk2.out
Running 1m test @ http://erik-pc.local:8080/greeting/Bob
  4 threads and 100 connections
  Thread calibration: mean lat.: 1.399ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.398ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.408ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.382ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.44ms    0.92ms  19.58ms   78.30%
    Req/Sec    26.34k     2.70k   52.56k    81.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.32ms
 75.000%    1.92ms
 90.000%    2.40ms
 99.000%    3.75ms
 99.900%   10.53ms
 99.990%   14.19ms
 99.999%   17.60ms
100.000%   19.60ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.113     0.000000            1         1.00
       0.492     0.100000       499095         1.11
       0.725     0.200000       998164         1.25
       0.941     0.300000      1496264         1.43
       1.138     0.400000      1995196         1.67
       1.321     0.500000      2493908         2.00
       1.418     0.550000      2745517         2.22
       1.526     0.600000      2993354         2.50
       1.650     0.650000      3243192         2.86
       1.786     0.700000      3492866         3.33
       1.924     0.750000      3742205         4.00
       1.991     0.775000      3866878         4.44
       2.059     0.800000      3992608         5.00
       2.127     0.825000      4116298         5.71
       2.201     0.850000      4241103         6.67
       2.287     0.875000      4365316         8.00
       2.337     0.887500      4427053         8.89
       2.397     0.900000      4490702        10.00
       2.467     0.912500      4551707        11.43
       2.553     0.925000      4613780        13.33
       2.655     0.937500      4676881        16.00
       2.709     0.943750      4707096        17.78
       2.769     0.950000      4739061        20.00
       2.831     0.956250      4770241        22.86
       2.895     0.962500      4800947        26.67
       2.965     0.968750      4832303        32.00
       3.003     0.971875      4847557        35.56
       3.047     0.975000      4863395        40.00
       3.097     0.978125      4878942        45.71
       3.159     0.981250      4894361        53.33
       3.247     0.984375      4909729        64.00
       3.315     0.985938      4917487        71.11
       3.421     0.987500      4925233        80.00
       3.603     0.989062      4932954        91.43
       3.885     0.990625      4940732       106.67
       4.443     0.992188      4948532       128.00
       4.815     0.992969      4952457       142.22
       5.271     0.993750      4956338       160.00
       5.759     0.994531      4960221       182.86
       6.323     0.995313      4964130       213.33
       6.939     0.996094      4968015       256.00
       7.287     0.996484      4969961       284.44
       7.647     0.996875      4971906       320.00
       8.043     0.997266      4973858       365.71
       8.487     0.997656      4975796       426.67
       8.959     0.998047      4977752       512.00
       9.231     0.998242      4978719       568.89
       9.519     0.998437      4979696       640.00
       9.823     0.998633      4980673       731.43
      10.175     0.998828      4981642       853.33
      10.575     0.999023      4982627      1024.00
      10.791     0.999121      4983123      1137.78
      11.007     0.999219      4983605      1280.00
      11.271     0.999316      4984079      1462.86
      11.543     0.999414      4984574      1706.67
      11.839     0.999512      4985050      2048.00
      11.991     0.999561      4985296      2275.56
      12.183     0.999609      4985538      2560.00
      12.375     0.999658      4985788      2925.71
      12.591     0.999707      4986027      3413.33
      12.823     0.999756      4986271      4096.00
      12.951     0.999780      4986396      4551.11
      13.159     0.999805      4986513      5120.00
      13.351     0.999829      4986634      5851.43
      13.623     0.999854      4986754      6826.67
      13.871     0.999878      4986877      8192.00
      14.023     0.999890      4986937      9102.22
      14.239     0.999902      4987002     10240.00
      14.479     0.999915      4987059     11702.86
      14.799     0.999927      4987119     13653.33
      15.119     0.999939      4987180     16384.00
      15.407     0.999945      4987211     18204.44
      15.663     0.999951      4987244     20480.00
      15.871     0.999957      4987271     23405.71
      16.199     0.999963      4987302     27306.67
      16.543     0.999969      4987333     32768.00
      16.671     0.999973      4987349     36408.89
      16.831     0.999976      4987363     40960.00
      17.007     0.999979      4987380     46811.43
      17.135     0.999982      4987393     54613.33
      17.263     0.999985      4987408     65536.00
      17.375     0.999986      4987416     72817.78
      17.487     0.999988      4987426     81920.00
      17.551     0.999989      4987432     93622.86
      17.663     0.999991      4987439    109226.67
      17.807     0.999992      4987446    131072.00
      17.839     0.999993      4987451    145635.56
      17.855     0.999994      4987454    163840.00
      17.887     0.999995      4987458    187245.71
      17.999     0.999995      4987462    218453.33
      18.063     0.999996      4987465    262144.00
      18.143     0.999997      4987467    291271.11
      18.303     0.999997      4987469    327680.00
      18.367     0.999997      4987471    374491.43
      18.463     0.999998      4987473    436906.67
      18.511     0.999998      4987475    524288.00
      18.559     0.999998      4987476    582542.22
      18.639     0.999998      4987477    655360.00
      18.783     0.999999      4987478    748982.86
      18.815     0.999999      4987479    873813.33
      18.863     0.999999      4987480   1048576.00
      18.863     0.999999      4987480   1165084.44
      18.927     0.999999      4987481   1310720.00
      18.927     0.999999      4987481   1497965.71
      19.295     0.999999      4987482   1747626.67
      19.295     1.000000      4987482   2097152.00
      19.295     1.000000      4987482   2330168.89
      19.311     1.000000      4987483   2621440.00
      19.311     1.000000      4987483   2995931.43
      19.311     1.000000      4987483   3495253.33
      19.311     1.000000      4987483   4194304.00
      19.311     1.000000      4987483   4660337.78
      19.599     1.000000      4987484   5242880.00
      19.599     1.000000      4987484          inf
#[Mean    =        1.444, StdDeviation   =        0.922]
#[Max     =       19.584, Total count    =      4987484]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5970364 requests in 1.00m, 415.65MB read
Requests/sec:  99506.08
Transfer/sec:      6.93MB